grevaillot/svd_tools/headers/STM32L4x5/can1.h
#define CAN1_RI1R_EXID_SHIFT		3
#define CAN1_RI1R_EXID_MASK		0x3ffff
/** @defgroup can1_ri1r_exid EXID EXID
@{*/
/**@}*/

/** CAN1_RI1R_IDE IDE **/
#define CAN1_RI1R_IDE		(1 << 2)
/** CAN1_RI1R_RTR RTR **/
#define CAN1_RI1R_RTR		(1 << 1)

/**@}*/

/** @defgroup can1_rdt1r RDT1R mailbox data high register
@{*/


#define CAN1_RDT1R_TIME_SHIFT		16
#define CAN1_RDT1R_TIME_MASK		0xffff
/** @defgroup can1_rdt1r_time TIME TIME
@{*/
/**@}*/


#define CAN1_RDT1R_FMI_SHIFT		8
#define CAN1_RDT1R_FMI_MASK		0xff
/** @defgroup can1_rdt1r_fmi FMI FMI
@{*/
/**@}*/


#define CAN1_RDT1R_DLC_SHIFT		0
#define CAN1_RDT1R_DLC_MASK		0x0f
/** @defgroup can1_rdt1r_dlc DLC DLC
@{*/
/**@}*/


/**@}*/

/** @defgroup can1_rdl1r RDL1R mailbox data high register
@{*/


#define CAN1_RDL1R_DATA3_SHIFT		24
#define CAN1_RDL1R_DATA3_MASK		0xff
/** @defgroup can1_rdl1r_data3 DATA3 DATA3
@{*/
/**@}*/


#define CAN1_RDL1R_DATA2_SHIFT		16
#define CAN1_RDL1R_DATA2_MASK		0xff
/** @defgroup can1_rdl1r_data2 DATA2 DATA2
@{*/
/**@}*/


#define CAN1_RDL1R_DATA1_SHIFT		8
#define CAN1_RDL1R_DATA1_MASK		0xff
/** @defgroup can1_rdl1r_data1 DATA1 DATA1
@{*/
/**@}*/


#define CAN1_RDL1R_DATA0_SHIFT		0
#define CAN1_RDL1R_DATA0_MASK		0xff
/** @defgroup can1_rdl1r_data0 DATA0 DATA0
@{*/
/**@}*/


/**@}*/

/** @defgroup can1_rdh1r RDH1R mailbox data high register
@{*/


#define CAN1_RDH1R_DATA7_SHIFT		24
#define CAN1_RDH1R_DATA7_MASK		0xff
/** @defgroup can1_rdh1r_data7 DATA7 DATA7
@{*/
/**@}*/


#define CAN1_RDH1R_DATA6_SHIFT		16
#define CAN1_RDH1R_DATA6_MASK		0xff
/** @defgroup can1_rdh1r_data6 DATA6 DATA6
@{*/
/**@}*/


#define CAN1_RDH1R_DATA5_SHIFT		8
#define CAN1_RDH1R_DATA5_MASK		0xff
/** @defgroup can1_rdh1r_data5 DATA5 DATA5
@{*/
/**@}*/


#define CAN1_RDH1R_DATA4_SHIFT		0
#define CAN1_RDH1R_DATA4_MASK		0xff
/** @defgroup can1_rdh1r_data4 DATA4 DATA4
@{*/
/**@}*/


/**@}*/

/** @defgroup can1_f0r1 F0R1 Filter bank 0 register 1
@{*/

/** CAN1_F0R1_FB31 Filter bits **/
#define CAN1_F0R1_FB31		(1 << 31)
/** CAN1_F0R1_FB30 Filter bits **/
#define CAN1_F0R1_FB30		(1 << 30)
/** CAN1_F0R1_FB29 Filter bits **/
#define CAN1_F0R1_FB29		(1 << 29)
/** CAN1_F0R1_FB28 Filter bits **/
#define CAN1_F0R1_FB28		(1 << 28)
/** CAN1_F0R1_FB27 Filter bits **/
#define CAN1_F0R1_FB27		(1 << 27)
/** CAN1_F0R1_FB26 Filter bits **/
#define CAN1_F0R1_FB26		(1 << 26)
/** CAN1_F0R1_FB25 Filter bits **/
#define CAN1_F0R1_FB25		(1 << 25)
/** CAN1_F0R1_FB24 Filter bits **/
#define CAN1_F0R1_FB24		(1 << 24)
/** CAN1_F0R1_FB23 Filter bits **/
#define CAN1_F0R1_FB23		(1 << 23)
/** CAN1_F0R1_FB22 Filter bits **/
#define CAN1_F0R1_FB22		(1 << 22)
/** CAN1_F0R1_FB21 Filter bits **/
#define CAN1_F0R1_FB21		(1 << 21)
/** CAN1_F0R1_FB20 Filter bits **/
#define CAN1_F0R1_FB20		(1 << 20)
/** CAN1_F0R1_FB19 Filter bits **/
#define CAN1_F0R1_FB19		(1 << 19)
/** CAN1_F0R1_FB18 Filter bits **/
#define CAN1_F0R1_FB18		(1 << 18)
/** CAN1_F0R1_FB17 Filter bits **/
#define CAN1_F0R1_FB17		(1 << 17)
/** CAN1_F0R1_FB16 Filter bits **/
#define CAN1_F0R1_FB16		(1 << 16)
/** CAN1_F0R1_FB15 Filter bits **/
#define CAN1_F0R1_FB15		(1 << 15)
/** CAN1_F0R1_FB14 Filter bits **/
#define CAN1_F0R1_FB14		(1 << 14)
/** CAN1_F0R1_FB13 Filter bits **/
#define CAN1_F0R1_FB13		(1 << 13)
/** CAN1_F0R1_FB12 Filter bits **/
#define CAN1_F0R1_FB12		(1 << 12)
/** CAN1_F0R1_FB11 Filter bits **/
#define CAN1_F0R1_FB11		(1 << 11)
/** CAN1_F0R1_FB10 Filter bits **/
#define CAN1_F0R1_FB10		(1 << 10)
/** CAN1_F0R1_FB9 Filter bits **/
#define CAN1_F0R1_FB9		(1 << 9)
/** CAN1_F0R1_FB8 Filter bits **/
#define CAN1_F0R1_FB8		(1 << 8)
/** CAN1_F0R1_FB7 Filter bits **/
#define CAN1_F0R1_FB7		(1 << 7)
/** CAN1_F0R1_FB6 Filter bits **/
#define CAN1_F0R1_FB6		(1 << 6)
/** CAN1_F0R1_FB5 Filter bits **/
#define CAN1_F0R1_FB5		(1 << 5)
/** CAN1_F0R1_FB4 Filter bits **/
#define CAN1_F0R1_FB4		(1 << 4)
/** CAN1_F0R1_FB3 Filter bits **/
#define CAN1_F0R1_FB3		(1 << 3)
/** CAN1_F0R1_FB2 Filter bits **/
#define CAN1_F0R1_FB2		(1 << 2)
/** CAN1_F0R1_FB1 Filter bits **/
#define CAN1_F0R1_FB1		(1 << 1)
/** CAN1_F0R1_FB0 Filter bits **/
#define CAN1_F0R1_FB0		(1 << 0)

/**@}*/

/** @defgroup can1_f0r2 F0R2 Filter bank 0 register 2
@{*/

/** CAN1_F0R2_FB31 Filter bits **/
#define CAN1_F0R2_FB31		(1 << 31)
/** CAN1_F0R2_FB30 Filter bits **/
#define CAN1_F0R2_FB30		(1 << 30)
/** CAN1_F0R2_FB29 Filter bits **/
#define CAN1_F0R2_FB29		(1 << 29)
/** CAN1_F0R2_FB28 Filter bits **/
#define CAN1_F0R2_FB28		(1 << 28)
/** CAN1_F0R2_FB27 Filter bits **/
#define CAN1_F0R2_FB27		(1 << 27)
/** CAN1_F0R2_FB26 Filter bits **/
#define CAN1_F0R2_FB26		(1 << 26)
/** CAN1_F0R2_FB25 Filter bits **/
#define CAN1_F0R2_FB25		(1 << 25)
/** CAN1_F0R2_FB24 Filter bits **/
#define CAN1_F0R2_FB24		(1 << 24)
/** CAN1_F0R2_FB23 Filter bits **/
#define CAN1_F0R2_FB23		(1 << 23)
/** CAN1_F0R2_FB22 Filter bits **/
#define CAN1_F0R2_FB22		(1 << 22)
/** CAN1_F0R2_FB21 Filter bits **/
#define CAN1_F0R2_FB21		(1 << 21)
/** CAN1_F0R2_FB20 Filter bits **/
#define CAN1_F0R2_FB20		(1 << 20)
/** CAN1_F0R2_FB19 Filter bits **/
#define CAN1_F0R2_FB19		(1 << 19)
/** CAN1_F0R2_FB18 Filter bits **/
#define CAN1_F0R2_FB18		(1 << 18)
/** CAN1_F0R2_FB17 Filter bits **/
#define CAN1_F0R2_FB17		(1 << 17)
/** CAN1_F0R2_FB16 Filter bits **/
#define CAN1_F0R2_FB16		(1 << 16)
/** CAN1_F0R2_FB15 Filter bits **/
#define CAN1_F0R2_FB15		(1 << 15)
/** CAN1_F0R2_FB14 Filter bits **/
#define CAN1_F0R2_FB14		(1 << 14)
/** CAN1_F0R2_FB13 Filter bits **/
#define CAN1_F0R2_FB13		(1 << 13)
/** CAN1_F0R2_FB12 Filter bits **/
#define CAN1_F0R2_FB12		(1 << 12)
/** CAN1_F0R2_FB11 Filter bits **/
#define CAN1_F0R2_FB11		(1 << 11)
/** CAN1_F0R2_FB10 Filter bits **/
#define CAN1_F0R2_FB10		(1 << 10)
/** CAN1_F0R2_FB9 Filter bits **/
#define CAN1_F0R2_FB9		(1 << 9)
/** CAN1_F0R2_FB8 Filter bits **/
#define CAN1_F0R2_FB8		(1 << 8)
/** CAN1_F0R2_FB7 Filter bits **/
#define CAN1_F0R2_FB7		(1 << 7)
/** CAN1_F0R2_FB6 Filter bits **/
#define CAN1_F0R2_FB6		(1 << 6)
/** CAN1_F0R2_FB5 Filter bits **/
#define CAN1_F0R2_FB5		(1 << 5)
/** CAN1_F0R2_FB4 Filter bits **/
#define CAN1_F0R2_FB4		(1 << 4)
/** CAN1_F0R2_FB3 Filter bits **/
#define CAN1_F0R2_FB3		(1 << 3)
/** CAN1_F0R2_FB2 Filter bits **/
#define CAN1_F0R2_FB2		(1 << 2)
/** CAN1_F0R2_FB1 Filter bits **/
#define CAN1_F0R2_FB1		(1 << 1)
/** CAN1_F0R2_FB0 Filter bits **/
#define CAN1_F0R2_FB0		(1 << 0)

/**@}*/

/** @defgroup can1_f1r1 F1R1 Filter bank 1 register 1
@{*/

/** CAN1_F1R1_FB31 Filter bits **/
#define CAN1_F1R1_FB31		(1 << 31)
/** CAN1_F1R1_FB30 Filter bits **/
#define CAN1_F1R1_FB30		(1 << 30)
/** CAN1_F1R1_FB29 Filter bits **/
#define CAN1_F1R1_FB29		(1 << 29)
/** CAN1_F1R1_FB28 Filter bits **/
#define CAN1_F1R1_FB28		(1 << 28)
/** CAN1_F1R1_FB27 Filter bits **/
#define CAN1_F1R1_FB27		(1 << 27)
/** CAN1_F1R1_FB26 Filter bits **/
#define CAN1_F1R1_FB26		(1 << 26)
/** CAN1_F1R1_FB25 Filter bits **/
#define CAN1_F1R1_FB25		(1 << 25)
/** CAN1_F1R1_FB24 Filter bits **/
#define CAN1_F1R1_FB24		(1 << 24)
/** CAN1_F1R1_FB23 Filter bits **/
#define CAN1_F1R1_FB23		(1 << 23)
/** CAN1_F1R1_FB22 Filter bits **/
#define CAN1_F1R1_FB22		(1 << 22)
/** CAN1_F1R1_FB21 Filter bits **/
#define CAN1_F1R1_FB21		(1 << 21)
/** CAN1_F1R1_FB20 Filter bits **/
#define CAN1_F1R1_FB20		(1 << 20)
/** CAN1_F1R1_FB19 Filter bits **/
#define CAN1_F1R1_FB19		(1 << 19)
/** CAN1_F1R1_FB18 Filter bits **/
#define CAN1_F1R1_FB18		(1 << 18)
/** CAN1_F1R1_FB17 Filter bits **/
#define CAN1_F1R1_FB17		(1 << 17)
/** CAN1_F1R1_FB16 Filter bits **/
#define CAN1_F1R1_FB16		(1 << 16)
/** CAN1_F1R1_FB15 Filter bits **/
#define CAN1_F1R1_FB15		(1 << 15)
/** CAN1_F1R1_FB14 Filter bits **/
#define CAN1_F1R1_FB14		(1 << 14)
/** CAN1_F1R1_FB13 Filter bits **/
#define CAN1_F1R1_FB13		(1 << 13)
/** CAN1_F1R1_FB12 Filter bits **/
#define CAN1_F1R1_FB12		(1 << 12)
/** CAN1_F1R1_FB11 Filter bits **/
#define CAN1_F1R1_FB11		(1 << 11)
/** CAN1_F1R1_FB10 Filter bits **/
#define CAN1_F1R1_FB10		(1 << 10)
/** CAN1_F1R1_FB9 Filter bits **/
#define CAN1_F1R1_FB9		(1 << 9)
/** CAN1_F1R1_FB8 Filter bits **/
#define CAN1_F1R1_FB8		(1 << 8)
/** CAN1_F1R1_FB7 Filter bits **/
#define CAN1_F1R1_FB7		(1 << 7)
/** CAN1_F1R1_FB6 Filter bits **/
#define CAN1_F1R1_FB6		(1 << 6)
/** CAN1_F1R1_FB5 Filter bits **/
#define CAN1_F1R1_FB5		(1 << 5)
/** CAN1_F1R1_FB4 Filter bits **/
#define CAN1_F1R1_FB4		(1 << 4)
/** CAN1_F1R1_FB3 Filter bits **/
#define CAN1_F1R1_FB3		(1 << 3)
/** CAN1_F1R1_FB2 Filter bits **/
#define CAN1_F1R1_FB2		(1 << 2)
/** CAN1_F1R1_FB1 Filter bits **/
#define CAN1_F1R1_FB1		(1 << 1)
/** CAN1_F1R1_FB0 Filter bits **/
#define CAN1_F1R1_FB0		(1 << 0)

/**@}*/

/** @defgroup can1_f1r2 F1R2 Filter bank 1 register 2
@{*/

/** CAN1_F1R2_FB31 Filter bits **/
#define CAN1_F1R2_FB31		(1 << 31)
/** CAN1_F1R2_FB30 Filter bits **/
#define CAN1_F1R2_FB30		(1 << 30)
/** CAN1_F1R2_FB29 Filter bits **/
#define CAN1_F1R2_FB29		(1 << 29)
/** CAN1_F1R2_FB28 Filter bits **/
#define CAN1_F1R2_FB28		(1 << 28)
/** CAN1_F1R2_FB27 Filter bits **/
#define CAN1_F1R2_FB27		(1 << 27)
/** CAN1_F1R2_FB26 Filter bits **/
#define CAN1_F1R2_FB26		(1 << 26)
/** CAN1_F1R2_FB25 Filter bits **/
#define CAN1_F1R2_FB25		(1 << 25)
/** CAN1_F1R2_FB24 Filter bits **/
#define CAN1_F1R2_FB24		(1 << 24)
/** CAN1_F1R2_FB23 Filter bits **/
#define CAN1_F1R2_FB23		(1 << 23)
/** CAN1_F1R2_FB22 Filter bits **/
#define CAN1_F1R2_FB22		(1 << 22)
/** CAN1_F1R2_FB21 Filter bits **/
#define CAN1_F1R2_FB21		(1 << 21)
/** CAN1_F1R2_FB20 Filter bits **/
#define CAN1_F1R2_FB20		(1 << 20)
/** CAN1_F1R2_FB19 Filter bits **/
#define CAN1_F1R2_FB19		(1 << 19)
/** CAN1_F1R2_FB18 Filter bits **/
#define CAN1_F1R2_FB18		(1 << 18)
/** CAN1_F1R2_FB17 Filter bits **/
#define CAN1_F1R2_FB17		(1 << 17)
/** CAN1_F1R2_FB16 Filter bits **/
#define CAN1_F1R2_FB16		(1 << 16)
/** CAN1_F1R2_FB15 Filter bits **/
#define CAN1_F1R2_FB15		(1 << 15)
/** CAN1_F1R2_FB14 Filter bits **/
#define CAN1_F1R2_FB14		(1 << 14)
/** CAN1_F1R2_FB13 Filter bits **/
#define CAN1_F1R2_FB13		(1 << 13)
/** CAN1_F1R2_FB12 Filter bits **/
#define CAN1_F1R2_FB12		(1 << 12)
/** CAN1_F1R2_FB11 Filter bits **/
#define CAN1_F1R2_FB11		(1 << 11)
/** CAN1_F1R2_FB10 Filter bits **/
#define CAN1_F1R2_FB10		(1 << 10)
/** CAN1_F1R2_FB9 Filter bits **/
#define CAN1_F1R2_FB9		(1 << 9)
/** CAN1_F1R2_FB8 Filter bits **/
#define CAN1_F1R2_FB8		(1 << 8)
/** CAN1_F1R2_FB7 Filter bits **/
#define CAN1_F1R2_FB7		(1 << 7)
/** CAN1_F1R2_FB6 Filter bits **/
#define CAN1_F1R2_FB6		(1 << 6)
/** CAN1_F1R2_FB5 Filter bits **/
#define CAN1_F1R2_FB5		(1 << 5)
/** CAN1_F1R2_FB4 Filter bits **/
#define CAN1_F1R2_FB4		(1 << 4)
/** CAN1_F1R2_FB3 Filter bits **/
#define CAN1_F1R2_FB3		(1 << 3)
/** CAN1_F1R2_FB2 Filter bits **/
#define CAN1_F1R2_FB2		(1 << 2)
/** CAN1_F1R2_FB1 Filter bits **/
#define CAN1_F1R2_FB1		(1 << 1)
/** CAN1_F1R2_FB0 Filter bits **/
#define CAN1_F1R2_FB0		(1 << 0)

/**@}*/

